output/posts/misc/debugging-with-gdb/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Debugging with gdb | Knowledge Database</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/misc/debugging-with-gdb/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="schoettkr">
<meta property="og:site_name" content="Knowledge Database">
<meta property="og:title" content="Debugging with gdb">
<meta property="og:url" content="https://example.com/posts/misc/debugging-with-gdb/">
<meta property="og:description" content="How to debug a c program with gdb



Step 1. Compile the C program with debugging option


Compile the C program with the debugging option which is usually -g for most compilers. This allows the compi">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-10-27T00:00:00+02:00">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://example.com/" title="Knowledge Database" rel="home">
                Knowledge Database
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../../archive.html">Archive</a></li>
                <li><a href="../../../categories/">Tags</a></li>
                <li><a href="../../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Debugging with gdb
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2018-10-27T00:00:00+02:00">2018/10/27</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-orgdb798a8" class="outline-2">
<h2 id="orgdb798a8">How to debug a c program with gdb</h2>
<div class="outline-text-2" id="text-orgdb798a8">
</div>
<div id="outline-container-org99d4498" class="outline-4">
<h4 id="org99d4498">Step 1. Compile the C program with debugging option</h4>
<div class="outline-text-4" id="text-org99d4498">
<p>
Compile the C program with the debugging option which is usually <code>-g</code> for most compilers. This allows the compiler to collect the debugging information.
</p>
<div class="highlight"><pre><span></span>gcc -g example.c
</pre></div>
<p>
The above command creates a <code>a.out</code> file which will be used for debugging. Of course other compiler options e.g specifying file name or turning on warnings is possible!
</p>
</div>
</div>
<div id="outline-container-orgd898800" class="outline-4">
<h4 id="orgd898800">Step 2. Launch gdb</h4>
<div class="outline-text-4" id="text-orgd898800">
<p>
Launch the C debugger gdb as shown below:
</p>
<div class="highlight"><pre><span></span>gdb a.out
</pre></div>
</div>
</div>
<div id="outline-container-org313e7fd" class="outline-4">
<h4 id="org313e7fd">Step 3. Set breakpoints</h4>
<div class="outline-text-4" id="text-org313e7fd">
<p>
Places break point in the C program, where you suspect errors. While executing the program, the debugger will stop at the break point, and gives you the prompt to debug.
To set a breakpoint enter the following:
</p>
<div class="highlight"><pre><span></span><span class="nb">break</span> <span class="o">{</span>linenumber<span class="o">}</span>
</pre></div>
<p>
Additionally it is also possible to do so in the following formats/ways (the filename is optional):
</p>
<div class="highlight"><pre><span></span><span class="nb">break</span> <span class="o">{</span>filename:<span class="o">}{</span>lineNumber<span class="o">}</span>
<span class="nb">break</span> <span class="o">{</span>filename:<span class="o">}{</span>functionName<span class="o">}</span>
</pre></div>
</div>
</div>
<div id="outline-container-org3ec17d2" class="outline-4">
<h4 id="org3ec17d2">Step 4. Execute the C program</h4>
<div class="outline-text-4" id="text-org3ec17d2">
<p>
Now the program can be executed using the <code>run</code> command in the gdb debugger. It is now also possible to specify command line arguments via <code>run {args}</code>.
The program then executes until it encounters the first breakpoint or finishes execution and stops.
</p>
</div>
</div>
<div id="outline-container-org7115561" class="outline-4">
<h4 id="org7115561">Step 5. It stopped - now what?!</h4>
<div class="outline-text-4" id="text-org7115561">
<p>
Now since the execution is halted there multiple things you can do. <code>print {varName}</code> prints the current value of an variable (can be shortened to <code>p</code>). <code>c</code> or <code>continue</code> resumes execution until the next breakpoint. <code>n</code> or <code>next</code> executes the next line as <i>a single instruction</i>. <code>s</code> or <code>step</code> same as <code>next</code> but doesn't treat functions as a single instruction, instead goes into the function to execute it line by line.
</p>

<p>
By the way <code>&lt;ENTER&gt;</code> repeats the previous command. <code>l</code> or <code>list</code> can be used to print the source code, <code>l {lineNumber}</code> can be used to view a specific line and <code>l {functionName}</code> to show a function. <code>bt</code> or <code>backtrack</code> prints a backtrace of all stack frames. Finally <code>quit</code> exits the gdb debugger.
</p>



<p>
Source: <a href="https://www.thegeekstuff.com/2010/03/debug-c-program-using-gdb/">https://www.thegeekstuff.com/2010/03/debug-c-program-using-gdb/</a>
</p>
</div>
</div>
</div>
        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2018         <a href="mailto:schoettkr@gmail.com">schoettkr</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><script src="../../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
